# -*- coding: utf-8 -*-
from time import time
print("="*30)
print("此程式為數獨遊戲的解題程式，只要是9*9大小都可以解出來")
print("Created by Koten @ Koten出品，必屬佳作")
print("Non-copyright @ 著作權沒有，翻拷不究")
print("="*30)

def boardInput(title,board):
    showresult=True
    board=[[int(num) if num.isdigit() else 0 for num in row]for row in board]
    print('第%s題:'%title,end='')
    if showresult:
        print('')
        for row in board:print(row)
    t = time()
    answer ,times = sudoku.runBoard(board)
    t = round((time()-t)*1000,2)
    if showresult:
        print('第%s題解答:'%title)
        for row in answer:print(row)
    #[print(''.join([str(i) for i in j])) for j in answer]
    print('花費',t,'毫秒，計算',times,'次。')
    #input('Press Enter...')

name=input('輸入檔案名稱:')
exec('import {} as sudoku'.format(name))
print(name)
testList=[
        [
        '9...7...5',
        '.1...28..',
        '.6.......',
        '.......4.',
        '..7.9....',
        '..4.536.1',
        '...8.7...',
        '.3.......',
        '..25.1..9'],
        [
        '..7....6.',
        '91..87...',
        '....54...',
        '....79..5',
        '..81...3.',
        '.......19',
        '8..3.....',
        '3....6.5.',
        '......47.'],
        [
        '..97....3',
        '..45...9.',
        '15..9....',
        '.....1...',
        '....8..61',
        '..2...8..',
        '.6.2.4...',
        '......7..',
        '79.....5.'],
        [
        '..5.7.2.6',
        '..3.2.5..',
        '.........',
        '..6.45...',
        '........9',
        '...1..37.',
        '7..9.....',
        '.8.2...6.',
        '4....3.8.'],
        [
        '3....19..',
        '....7.4..',
        '1..42....',
        '531....7.',
        '.49......',
        '...6.....',
        '.9...2.57',
        '2........',
        '...19..8.'],
        [
        '....7..6.',
        '...185..9',
        '45.9.....',
        '...8...1.',
        '62.......',
        '..3.....7',
        '...4.6...',
        '3........',
        '.48.5.19.'],
        [
        '.7.1...4.',
        '8..9..2..',
        '5....8...',
        '1.......3',
        '..6......',
        '..435..69',
        '....6.3..',
        '.6..8.4..',
        '9...7....'],
        [
        '13...5...',
        '5..7....2',
        '...2.9...',
        '.........',
        '91.....87',
        '..7.6..1.',
        '.5.4.....',
        '34.......',
        '8....63.5'],

        [
        '21.9.3...',
        '....718..',
        '.....2..6',
        '..7....13',
        '6......57',
        '..1......',
        '.62.5....',
        '...6..4..',
        '3.4......'],

        [
        '8........',
        '..36.....',
        '.7..9.2..',
        '.5...7...',
        '....457..',
        '...1...3.',
        '..1....68',
        '..85...1.',
        '.9....4..']]
t=time()
for i in range(len(testList)):
    try:boardInput(i+1,testList[i])
    except Exception as exp:print(exp)
t = round((time()-t)*1000,2)
print('總共花費',t,'毫秒。')
del sudoku
input('Press Enter to Continue..')
